{
  "_attn_implementation_autoset": true,
  "_name_or_path": "C:\\Users\\Capstone2026User\\pii-lab\\experiments\\baseline\\model\\checkpoint-run\\final-model",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-DOB",
    "4": "I-DOB",
    "5": "B-ADDRESS",
    "6": "I-ADDRESS",
    "7": "B-SSN",
    "8": "I-SSN",
    "9": "B-EMAIL",
    "10": "I-EMAIL",
    "11": "B-PHONE",
    "12": "I-PHONE",
    "13": "B-CREDIT_CARD",
    "14": "I-CREDIT_CARD",
    "15": "B-IP_ADDRESS",
    "16": "I-IP_ADDRESS"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ADDRESS": 5,
    "B-CREDIT_CARD": 13,
    "B-DOB": 3,
    "B-EMAIL": 9,
    "B-IP_ADDRESS": 15,
    "B-PERSON": 1,
    "B-PHONE": 11,
    "B-SSN": 7,
    "I-ADDRESS": 6,
    "I-CREDIT_CARD": 14,
    "I-DOB": 4,
    "I-EMAIL": 10,
    "I-IP_ADDRESS": 16,
    "I-PERSON": 2,
    "I-PHONE": 12,
    "I-SSN": 8,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 30522
}
